mach-3-wind-tunnel/system/blockMeshDict
// Mesh generated on 08-Mar-2021
// Local directory: /Users/fbisetti/teaching/ASE347/SP-2021/OF-assignments/of2/simulations/mesh
// Username: fbisetti


// Lf (fore)  =  4.00000e+00
// Lw (wake)  =  6.00000e+00
// R  (outer) =  1.00000e+00
// H  (top/bottom) = 4.00000

FoamFile
{
	version  2.0;
	format   ascii;
	class    dictionary;
	object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	( 0.000000e+00 0.000000e+00 -5.000000e-02 ) // 0
	( 6.000000e-01 0.000000e+00 -5.000000e-02 ) // 1
	( 9.464102e-01 2.000000e-01 -5.000000e-02 ) // 2
	( 0.000000e+00 1.000000e+00 -5.000000e-02 ) // 3
	( 6.000000e-01 1.000000e+00 -5.000000e-02 ) // 4
	( 9.464102e-01 8.000000e-01 -5.000000e-02 ) // 5
	( 3.000000e+00 2.000000e-01 -5.000000e-02 ) // 6
	( 3.000000e+00 8.000000e-01 -5.000000e-02 ) // 7
	( 0.000000e+00 0.000000e+00 5.000000e-02 ) // 8
	( 6.000000e-01 0.000000e+00 5.000000e-02 ) // 9
	( 9.464102e-01 2.000000e-01 5.000000e-02 ) // 10
	( 0.000000e+00 1.000000e+00 5.000000e-02 ) // 11
	( 6.000000e-01 1.000000e+00 5.000000e-02 ) // 12
	( 9.464102e-01 8.000000e-01 5.000000e-02 ) // 13
	( 3.000000e+00 2.000000e-01 5.000000e-02 ) // 14
	( 3.000000e+00 8.000000e-01 5.000000e-02 ) // 15
);

blocks
(

	// block 0 
	hex ( 0  1  4  3  8  9 12 11) ( 24  8  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)
	// block 1 
	hex ( 1  2  5  4  9 10 13 12) ( 24  8  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)
	// block 2 
	hex ( 2  6  7  5 10 14 15 13) ( 96  8  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)

);

edges
(



);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			( 0  8 11  3)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 6 14 15  7)
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			( 0  1 9 8)
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			( 3 11 12  4)
		);
	}

	obstacles
	{
		type patch;
		faces
		(
			( 4  12  13  5)
			( 5  13  15  7)
			( 1   9  10  2)
			( 2  10  14  6)
		);
	}

);
